# 站在历史正确的一边
# ——告台湾情治部门书
# 2020年10月15日 10:19:47 来源： 人民日报　作者： 安平
#
# 近期，媒体公开报道了我国家安全机关组织实施“迅雷—2020”专项行动的有关情况。
# 从披露内容看，这是继“2018—雷霆行动”之后，国家安全机关针对台湾当局及其间谍情报机关的又一次重拳出击。
# 此次专项行动，共破获数百起台湾间谍窃密案件，抓获一批台湾间谍及运用人员，打掉多个台湾间谍情报机关针对祖国大陆布建的间谍情报网络。
# 从2018年的百余起到2020年的数百起，案件数字的攀升，
# 背后折射出的是台湾当局及其间谍情报机关困兽犹斗，近乎疯狂地对祖国大陆实施各类情报渗透破坏活动。
#
# 无风不起浪。一个时期以来，在国际大气候和台湾岛内小气候影响下，蔡英文当局愈加挟洋自重，加紧与外部反华势力勾连聚合，
# 频频制造事端，严重危害两岸和平和台海局势稳定。根据国际危机组织观察，台湾海峡已被列入“重大形势恶化地区”。将心比心，
# 两岸人民都不愿兵戎相见。但如不幸战事爆发，罪魁祸首必是“台独”。更须值得警惕的是，战事未发，情报先行。
# 台湾情治部门不仅长期把祖国大陆当成攻击目标开展情报活动，近年来更沦为蔡英文当局党同伐异、铲除异己、推动“台独”路线的工具。
# 对内，借助修订“国安五法”、出台“反渗透法”，大搞“绿色恐怖”，严密监控岛内民众，限缩两岸交流交往。对外，奉行“金钱外交”“情报外交”，
# 甘当棋子，不惜出卖国家主权和台湾人民切身利益，换取美西方的庇护。
#
# 在蔡英文当局指使下，台湾情治部门积极充当“台独”分裂势力的“马前卒”“急先锋”，大搞不义之举，大行忤逆之道，弊案丛生，乱象纷呈。
# 去年“私烟案”一出，台湾民众大开眼界，原来综理岛内情治系统的台湾“国安局”竟然是最大的走私贩子，“总统”专机居然成了最高效的走私工具。
# 公器私用，大肆敛财。为全面推动“绿化”，“外行领导内行”也是台湾情治部门饱受诟病的顽疾。近年来，岛内情治系统元老多次公开表态，
# 台湾情治部门频频出现“情报关系被抓，情报人员出丑，情报工作受挫”的局面，根源就是“台独”恶瘤上身，两党内斗不休。
# 情治部门首脑如同把头埋在沙子里的鸵鸟，只知一味“崇蔡媚上”，以“非绿即蓝”划分阵营，不顾情报工作规律、不管情报人员死活。
# 这种环境下，台湾情治部门军心涣散、人心分离、士气低落，各为其主、各自为战，卖官鬻爵者有之，欺上瞒下者有之，贪墨经费者有之，
# 坑蒙拐骗者有之，情报造假者有之，一派穷途末路乱象。饶是如此，台湾情治部门个别人物还叫嚣着要协助台军构建所谓“不对称战力”，
# 妄图以一螳之臂阻挡历史前进的滚滚车轮。
#
# 历史大势，浩浩汤汤；顺之者昌，逆之者亡。习近平总书记深刻指出，我们愿意为和平统一创造广阔空间，但绝不为各种形式的“台独”分裂活动留下任何空间。
# 我们不承诺放弃使用武力，保留采取一切必要措施的选项，针对的是外部势力干涉和极少数“台独”分裂分子及其分裂活动，绝非针对台湾同胞。
# 我们愿意以最大诚意与广大台湾同胞共享和平，共谋发展，但对“台独”分裂势力谋“独”拒统、破坏和平的种种逆行，我们也必将依法严惩不贷。
# 我们奉劝台湾情治部门，不要被“台独”的“末路战车”所绑架，这辆“末路战车”的狂奔只有一个结局，就是粉身碎骨、身败名裂。
# 蔡英文当局只有一己政党之私利，完全不顾两岸同胞利益福祉，更遑论一线情报人员的死活。希望台湾情治部门能够看到民族大义与历史正道，
# 立即停止对祖国大陆的情报渗透破坏活动，尤其不要继续充当蔡英文当局的鹰犬和走狗，为“台独”分裂势力背书，继续向美西方出卖国家主权和中华民族核心利益。
# 否则，我国家安全机关有坚定的意志、充分的信心、足够的能力，对台湾情治部门任何渗透破坏活动依法予以坚决打击和严正惩戒。
#
# 我们正告台湾情治部门中抱守“台独”立场的顽固分子，玩火自焚只有死路一条，弃暗投明才是人间正道。对冥顽不化、死不悔改、
# 继续从事“台独”分裂活动，危害祖国国家安全和利益的死硬分子，我国家安全机关会坚决运用反分裂国家法、反间谍法等法律武器，紧盯不放、
# 穷追务获、一追到底。青山遮不住，毕竟东流去。希望这些顽固分子尽早认清形势，早早收手，回头是岸，莫要眷恋穷城，徘徊歧途，自寻绝路。
# 勿谓言之不预也。
#
# 我们欢迎台湾情治部门中拥护祖国统一的有识之士，有机会多到祖国大陆走一走、看一看，彻底摒弃蔡英文当局背宗忘祖的“台独”意识和狭隘的“岛民”心态，
# 亲身感受大陆巨大的发展变化，共同分享祖国蓬勃的发展机遇。血浓于水，守望相助。两岸同胞同根同源，同文同种，祖国大陆与你们沟通交流的大门永远敞开着，
# 欢迎通过各种形式、各种方式、各种渠道来开展各方面合作。渡尽劫波兄弟在，相逢一笑泯恩仇。希望我们携手一道，遏“台独”、反分裂、促和平，共筑抵御外侮、
# 捍卫国家主权的隐蔽防线，共绘中华团圆的美好明天。
#
# 历史若镜，岁月淘沙。解决台湾问题，实现祖国完全统一，是大势所趋、民心所向。完成这一历史大业，必须依靠两岸同胞的和衷共济、共同奋斗。
# 我们相信，只要两岸同胞共担民族大义，勠力同心，相向而行，必能共享中华民族复兴的伟大荣光。
# (全文完)

SB_HOLO = '''
Hololive ホロ 木口 术口
时乃空 ときのそら Tokino 空妈
萝卜子 ロボ子さん Roboko 大根子
樱巫女 さくらみこ Sakura Miko 樱火龙 elite工厂厂长 黄油精英巫女 赌鬼巫女 樱污女
星街彗星 星街 すいせい Hoshimati Suisei 星姐 阿星 彗彗 suisui 有点神经病的蓝发大姐姐 有点大姐姐的蓝发神经病
夜空梅露 夜空メル Yozora Mel 梅露 梅球王 Banpire 清楚系天才美少女吸血鬼
夏色祭 まつり Natsuiro Matsuri 马自立 祭妹 夏哥 夏半首
赤井心 赤井はあと Akai Haato 心心 心大人 はぁちゃま 哈恰玛 哈恰嘛
亚绮 罗森塔尔 アキ ローゼンタール Aki Rosenthal akirose 李姐 力速双A弱精灵
白上吹雪 白上フブキ Shirakami Fubuki 🌽 fbk 小狐狸 屑狐狸 喵喵狐 debuki 玉米人 赫鲁晓狐 工具狐
人见酷丽丝 人見クリス Hitomi Kurisu
凑阿库娅 湊あくあ Minato Aqua 阿库娅 洋葱 阿夸 夸哥 夸神 海王 山田赫敏 大亏哥 桐谷夸人 
紫咲诗音 紫咲シオン Murasaki Shion 诗音 傻紫 小学生 紫咲紫苑
百鬼绫目 百鬼あやめ Nakiri Ayame 狗狗 绫目
愈月巧可 癒月ちょこ Yuzuki Choco 巧可老师
大空昴 大空スバル Ōzora Subaru 古神 
大神澪 大神ミオ Ōkami Mio 大神三才 二哈 三才妈妈
猫又小粥 猫又おかゆ Nekomata Okayu 小粥 阿汤 汤哥 饭团猫 大脸猫
戌神 沁音 戌神ころね Inugami Korone 吼啦迷迭吼啦哟 面包狗 外神
兔田佩克拉 兎田ぺこら Usada Pekora 佩克拉 佩可拉 屑兔子 
润羽露西娅 潤羽るしあ Uruha Rushia 死灵魔法师 死灵使 绿粽子 三亚王 狂爆粽子 阿马粽
不知火芙蕾雅 不知火フレア Shiranui Flare 芙蕾雅 芙碳 阿火 ぬいぬい nuinui フーたん
白银诺艾尔 白銀ノエル Shirogane Noel 
宝钟 玛琳 宝鐘マリン Houshou Marine 无船承运人 山贼
天音彼方 天音かなた Amane Kanata 彼方碳 かなたん PP天使 天妈 音妹 天音 天音腾格尔
桐生可可 桐生 ココ Kiryū Kiryuu Coco 🐉 虫皇 龙皇 憨憨龙 ass龙 宝批龙 西成女王
角卷绵芽 角巻わため Tsunomaki Watame wtm 毛球 顶顶羊 咚咚羊 畜生羊 木口锤石
常暗永远 常闇トワ Tokoyami Towa 永远大人 トワ様
姬森璐娜 姫森 ルーナ Himemori Luuna 璐娜 英语教师
雪花菈米 雪花ラミィYukihana Lamy 菈米 雪花纯生 雪妈 菈米妈妈
桃铃音音 桃鈴ねね Momosuzu Nene 铃桃音音
狮白牡丹 獅白ぼたん Shishiro Botan 狮白
魔乃阿萝耶 魔乃アロエ Mano Aloe 魔乃 阿萝耶
尾丸波尔卡 尾丸ポルカ Omaru Polka 特质系西索 虚拟关羽
AZKi AZiK
Ayunda Risu 栗鼠 印尼面包狗 猫狗的女儿
Moona Hoshinova
Airani Iofifteen
噶呜 古拉 Gawr Gura がうる ぐら 鲨鲨 小鲨鱼 小傻鱼 傻鱼
一伊那尔栖 Ninomae Ina'nis 一伊那尓栖 伊那
森美声 Mori Calliope 巨乳版露西娅 巨乳露西娅
小鸟游琪亚拉 Takanashi Kiara 小鳥遊キアラ 琪亚拉
华生 阿米莉亚 Watson Amelia ワトソン アメリア 艾米
友人A YuujinA
谷乡元昭 YAGOO 谷郷元昭 Tanigou Motoaki
斯哈斯哈
'''.split()
# 复制完了 快吐了

from datetime import timedelta
from hoshino import Service, priv, util, R, HoshinoBot
from hoshino.typing import CQEvent

HAHAHA_VTB_TIANGOU = R.img('hahaha_vtb_tiangou.jpg')
sv = Service('anti-holo', manage_priv=priv.SUPERUSER)

@sv.on_keyword(SB_HOLO)
async def anti_holo(bot: HoshinoBot, ev: CQEvent):
    priv.set_block_user(ev.user_id, timedelta(minutes=1))
    await util.silence(ev, 60, skip_su=False)
    await bot.send(ev, HAHAHA_VTB_TIANGOU.cqcode)
    await bot.delete_msg(self_id=ev.self_id, message_id=ev.message_id)
